aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_256x128-SED1330.cpp
//-------------------------------------------------------------------------------------------------
//
//  File : lib_STM32F4_lcd_256x128-SED1330.cpp
//
//*************************************************************************************************

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#include "digini_cfg.h"
#ifdef DIGINI_USE_GRAFX
#include "stm32f4xx.h"
#include "lib_grafx.h"
#include "bsp.h"

uint8_t g_LayerDefinition;


void SED1330_Cursor(uint8_t byType, uint8_t byBehavior);
void SED1330_GotoMemory(int nAddress);

//-------------------------------------------------------------------------------------------------
// define(s)
//-------------------------------------------------------------------------------------------------

        #define SED1330_RD                    p3_3
        #define SED1330_WR                     p3_4
        #define SED1330_A0                  p3_5
        #define SED1330_RESET                p3_4
        #define SED1330_READ_PORT                p10
        #define SED1330_WRITE_PORT              p10
        #define SED1330_DATA                1
        #define SED1330_COMMAND                0
        #define SED1330_PARAMETER            0
        #define SED1330_ENABLE                0
        #define SED1330_DISABLE             1

        #define SED1330_X_SIZE              256
        #define SED1330_Y_SIZE              128


//-------------------------------------------------------------------------------------------------
// Forward Declaration
//-------------------------------------------------------------------------------------------------

//static void     DRV_Line                       (uint16_t PosX, uint16_t PosY, uint16_t Length, uint16_t ThickNess, DrawMode_e Direction);
static void     DRV_IO_Initialize                   (void);     // Initialize the IO on the processor
static void     DRV_LCD_ControllerInitialize        (void);     // LCD is equipped with a IL9341 controller
static void     DRV_LTDC_Initialize                 (void);     // Initialize the in processor LCD controller
static void     DRV_LAYER_Initialize                (void);
static void     DRV_WriteCommand                    (uint8_t Register);
static void     DRV_u8_Write                        (uint8_t Data);
static void     DRV_u16_Write                       (uint16_t Data);
static void     DRV__DrawRectangle                  (Box_t* pBox, uint8_t Mode);


void         DRV_Clear            (void);


// from c file

uint8_t     SED1330_ReadByte        (void);
uint16_t     SED1330_ReadWord        (void);
void         SED1330_Pixel            (uint8_t X, uint8_t Y, uint16_t Color);
void         SED1330_PutMaskByte        (uint8_t X, uint8_t Y, uint8_t Data);
void         SED1330_PutMaskWord        (uint8_t X, uint8_t Y, uint16_t Data);
void         SED1330_Put_u8            (uint8_t X, uint8_t Y, uint8_t Data);
void         SED1330_Put_u16            (uint8_t X, uint8_t Y, uint16_t Data);

//-------------------------------------------------------------------------------------------------
// private const(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// private variable(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Private Function(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_IO_Initialize
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    GPIO configuration specific for the LCD and processor used by this driver
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_IO_Initialize(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    // Enable GPIOA, GPIOI, GPIOJ, GPIOJ AHB Clocks
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                           RCC_AHB1Periph_GPIOB |
                           RCC_AHB1Periph_GPIOC |
                           RCC_AHB1Periph_GPIOD |
                           RCC_AHB1Periph_GPIOF |
                           RCC_AHB1Periph_GPIOG, ENABLE);

    // +------------------------+-----------------------+----------------------------+
    // +                       LCD pins assignment                                   +
    // +------------------------+-----------------------+----------------------------+
    // |  LCD_TFT R2 <-> PC.10  |  LCD_TFT G2 <-> PA.06 |  LCD_TFT B2 <-> PD.06      |
    // |  LCD_TFT R3 <-> PB.00  |  LCD_TFT G3 <-> PG.10 |  LCD_TFT B3 <-> PG.11      |
    // |  LCD_TFT R4 <-> PA.11  |  LCD_TFT G4 <-> PB.10 |  LCD_TFT B4 <-> PG.12      |
    // |  LCD_TFT R5 <-> PA.12  |  LCD_TFT G5 <-> PB.11 |  LCD_TFT B5 <-> PA.03      |
    // |  LCD_TFT R6 <-> PB.01  |  LCD_TFT G6 <-> PC.07 |  LCD_TFT B6 <-> PB.08      |
    // |  LCD_TFT R7 <-> PG.06  |  LCD_TFT G7 <-> PD.03 |  LCD_TFT B7 <-> PB.09      |
    // -------------------------------------------------------------------------------
    // |  LCD_TFT HSYNC <-> PC.06  | LCDTFT VSYNC <->  PA.04 |
    // |  LCD_TFT CLK   <-> PG.07  | LCD_TFT DE   <->  PF.10 |
    // |  LCD_TFT C/D   <-> PD.13  |                         |
    // -------------------------------------------------------

    // ---- GPIOs Configuration ----

    // GPIOs All other pin are configure the same
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AF;
    GPIO_InitStruct.GPIO_PuPd  = GPIO_PuPd_NOPULL;

