aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_256x128-SED1330.cpp
    // GPIOA configuration
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource4, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource11, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource12, GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_6 | GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    // GPIOB configuration
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource0,  9); //GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource1,  9);//GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource8,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource9,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource10,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource11,  GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11;
    GPIO_Init(GPIOB, &GPIO_InitStruct);

    // GPIOC configuration
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource6,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource7,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource10,  GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_10;
    GPIO_Init(GPIOC, &GPIO_InitStruct);

    // GPIOD configuration
    GPIO_PinAFConfig(GPIOD, GPIO_PinSource3,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOD, GPIO_PinSource6,  GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_6;
    GPIO_Init(GPIOD, &GPIO_InitStruct);

    // GPIOF configuration
    GPIO_PinAFConfig(GPIOF, GPIO_PinSource10, GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
    GPIO_Init(GPIOF, &GPIO_InitStruct);

    // GPIOG configuration
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource6,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource7,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource10,  9);//GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource11,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource12,  9);//GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_Init(GPIOG, &GPIO_InitStruct);

    // The following pin are output
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;

    // Port C pin 2 is a simple output to control CS on SPI interface
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2;
    GPIO_Init(GPIOC, &GPIO_InitStruct);
    GPIO_WriteBit(GPIOC, GPIO_Pin_2, Bit_SET);

    // Port D pin 13 is a simple output to control C/D pin on LCD
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_13;
    GPIO_Init(GPIOD, &GPIO_InitStruct);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_LCD_ControllerInitialize
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    LCD is equipped with a IL9341 controller that need to be initialize
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_LCD_ControllerInitialize(void)
{
    SED1330_RD = SED1330_DISABLE;
    SED1330_WR = SED1330_DISABLE;
    
    // System Control
    DRV_WriteCommand(SED1330_SYSTEM_SET);
    DRV_u8_Write(0x30);                //P1    IV=1 W/S=0 M2=0 M1=0 M0=0
    DRV_u8_Write(0x87);                //P2    W/F=1 FX=7
    DRV_u8_Write(0x07);                //P3    FY=7
    DRV_u8_Write(0x1F);                //P4    C/R=(32)-1 = 0x1F
    DRV_u8_Write(0x24);                //P5    T/CR=C/R+4 = 0x24
    DRV_u8_Write(0x7F);                //P6    Height in Line Of LCD
    DRV_u8_Write(SED1330_LINE_LENGTH);    //P7    Address Range virtual Screen (LCD = 42,Virtual = 48)    
    DRV_u8_Write(0x00);                //P8

    // Set Device memory Map
    DRV_WriteCommand(SED1330_SCROLL);
    DRV_u8_Write(SED1330_TEXT_LOW);    //P1    Text Area Layer 1 Start Address
    DRV_u8_Write(SED1330_TEXT_HIGH);    //P2    SAD1 = 0x0000
    DRV_u8_Write(0x80);                //P3    SL1  = 0x80
    DRV_u8_Write(SED1330_GRAPH_LOW);    //P4    Graphic Area Layer 2 Start Address
    DRV_u8_Write(SED1330_GRAPH_HIGH);    //P5    SAD2 = 0x0800
    DRV_u8_Write(0x80);                //P6    SL2  = 0x80
    DRV_u8_Write(SED1330_TEXT_LOW);    //P7    Text Area Layer 1 Start Address
    DRV_u8_Write(SED1330_TEXT_HIGH);    //P8    SAD2 = 0x0000
    
    // Set CG Ram Address
    DRV_WriteCommand(SED1330_CARGEN_ADDRESS);
    DRV_u8_Write(SED1330_CGRAM_LOW);            //P1    Address Set To 0x300
    DRV_u8_Write(SED1330_CGRAM_HIGH);            //P2            
    
    // Set Horizontal Shift
    DRV_WriteCommand(SED1330_SET_HORIZONTAL_SCROLL);
    DRV_u8_Write(0x00);                //P1    No Horizontal Pixel Shift

    // Set Layer Behavior
    DRV_WriteCommand(SED1330_OVERLAY);
//    DRV_u8_Write(TWO_LAYER | TEXT_MODE | OR_LOGIC);                                                //P1
    DRV_u8_Write(SED1330_TWO_LAYER | SED1330_OR_LOGIC);                                                //P1

    DRV_WriteCommand(SED1330_DISPLAY_OFF);
    g_LayerDefinition = SED1330_CURSOR_BLANK | SED1330_BLOCK_1_STEADY | SED1330_BLOCK_2_STEADY | SED1330_BLOCK_3_STEADY;
    DRV_u8_Write(g_LayerDefinition);    //P1

    // Clear display
    DRV_Clear();

    // Set cursor form and put Display ON
    DRV_SetCursor(SED1330_BLOCK, SED1330_CURSOR_BLANK);
    DRV_WriteCommand(SED1330_CURSOR_RIGHT);
}


//-------------------------------------------------------------------------------------------------
//
//  Function name:  DRV_LayerConfig
//
//  Parameter(s):   CLayer* pLayer
//  Return:         None
//
//  Description:    Configuration for layer
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_LAYER_Initialize(void)
{
//    DRV_LayerConfig(&LayerTable[BACKGROUND_DISPLAY_LAYER_0]);
//    DRV_LayerConfig(&LayerTable[FOREGROUND_DISPLAY_LAYER_0]);
}


//-------------------------------------------------------------------------------------------------
//
//  Function name:  WriteCommand
//
//  Parameter(s):   uint8_t         Command
//  Return value:   None
//
//  Description:    Send a command to LCD
//
//  Note(s):        any sub data will be sent using LCD_WriteByte
//
//-------------------------------------------------------------------------------------------------
static void DRV_WriteCommand(uint8_t Command)
{
       SED1330_A0 = SED1330_COMMAND;
    DRV_u8_Write(Command);
    SED1330_A0 = SED1330_DATA;            // There is almost all the time DATA following Command
}


//-------------------------------------------------------------------------------------------------
//
//   Function name: DRV_u8_Read
//
//   Parameter(s):  None
//   Return value:  uint8_t
//
//   Description:   Read 8 bits data from LCD
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
uint8_t DRV_u8_Read()
{
    uint8_t Data;

    SED1330_RD = SED1330_ENABLE;
    DelayUs(1);
    Data = SED1330_READ_PORT;
    SED1330_RD = SED1330_DISABLE;
    return Data;
}


//-------------------------------------------------------------------------------------------------
//
//   Function name: DRV_u16_Read
//
//   Parameter(s):  None
//   Return value:  uint16_t        Data
//
//   Description:   Read 15 bits data from LCD
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
WORD DRV_u16_Read()
{
    //????? don't know if this work   -> speculation
    uint16_t  Data;

    SED1330_RD = SED1330_ENABLE;
    DelayUs(1);
    Data = SED1330_READ_PORT << 8;
    SED1330_RD = SED1330_DISABLE;
    SED1330_RD = SED1330_ENABLE;
    DelayUs(1);
    Data |= SED1330_READ_PORT;
    SED1330_RD = SED1330_DISABLE;
    return Data;
}


//-------------------------------------------------------------------------------------------------
//
//   Function name: DRV_u8_Write
//
//   Parameter(s):  uint8_t         Data
//   Return value:  None
//
//   Description:   Write 8 bits data to LCD
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_u8_Write(uint8_t Data)
{
    SED1330_WRITE_PORT = Data;
    SED1330_WR = SED1330_ENABLE;
    DelayUs(1);
    SED1330_WR = SED1330_DISABLE;
}


//-------------------------------------------------------------------------------------------------
//
//   Function name: DRV_u16_Write
//
//   Parameter(s):  uint16_t         Data
//   Return value:  None
//
//   Description:   Write 16 bits data to LCD
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_u16_Write(uint16_t Data)
{
    SED1330_WRITE_PORT = (uint8_t)(Data >> 8);
    SED1330_WR = SED1330_ENABLE;
    DelayUs(1);
    SED1330_WR = SED1330_DISABLE;
    SED1330_WRITE_PORT = (uint8_t)Data;
    SED1330_WR = SED1330_ENABLE;
    DelayUs(1);
}

