aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_256x128-SED1330.cpp
//-----------------------------------------------------------------------------
//
// Set cursor form and behavior
//
//-----------------------------------------------------------------------------
void SED1330_SetCursor(uint8_t Type, uint8_t Behavior)
{
    DRV_WriteCommand(SED1330_CURSOR_FORM);
    DRV_u8_Write(0x07);                            // P1            Width Of Cursor
    DRV_u8_Write(0x07 | Type);                    // P2            Height Of Cursor + Cursor Mode    
    
    DRV_WriteCommand(SED1330_DISPLAY_ON);
    g_LayerDefinition = (g_LayerDefinition & 0xFC) | Behavior;
    DRV_u8_Write(g_LayerDefinition);            // P1
}


//-----------------------------------------------------------------------------
//
// Goto a specific Memory Location
//
//-----------------------------------------------------------------------------
static void DRV_GotoMemory(int Address)
{
    DRV_WriteCommand(SED1330_SET_CURSOR_ADDRESS);
    DRV_u8_Write((uint8_t)Address);                    //P1
    DRV_u8_Write((uint8_t)(Address >> 8));            //P2
}


//-----------------------------------------------------------------------------
//
// Put a uint8_t in graphic memory
//
//-----------------------------------------------------------------------------
static void SED1330_PutByte(int Address, uint8_t Byte)
{
    DRV_GotoMemory(SED1330_GRAPHIC_MEMORY + Address);
    DRV_WriteCommand(SED1330_MEMORY_WRITE);
    DRV_u8_Write(Byte);
}


//-------------------------------------------------------------------------------------------------
//
//   Function name: DRV__DrawRectangle
//
//   Parameter(s):  Box_t*  pBox
//                  uint8_t Mode
//   Return value:  None
//
//   Description:   Draw a box or a rectangle
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV__DrawRectangle(Box_t* pBox, uint8_t Mode)
{
}

//-------------------------------------------------------------------------------------------------
// Global Function(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//  Name:           Initialize
//
//  Parameter(s):   void* Arg           ( to pass any kind data the driver might need
//  Return:         None
//
//  Description:    LCD configuration specific for the LCD and processor used by this driver
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------

void DRV_Initialize(void* pArg)
{
    VAR_UNUSED(pArg);
    DRV_IO_Initialize();                    // Initialize the IO on the processor
    DRV_LCD_ControllerInitialize();
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_LayerConfig
//
//  Parameter(s):   CLayer* pLayer
//  Return:         None
//
//  Description:    Configuration for layer
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_LayerConfig(CLayer* pLayer)
{
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_Copy
//
//  Parameter(s):   void*           pSrc
//                  Box_t*          pBox
//                  Cartesian_t*    pDstPos
//                  PixelFormat_e   SrcPixelFormat_e
//                  BlendMode_e     BlendMode
//  Return:         None
//
//  Description:    Copy a rectangle region from square memory region to another square memory
//                  region
//
//  Note(s):        Source is linear
//
//-------------------------------------------------------------------------------------------------
void DRV_Copy(void* pSrc, Box_t* pBox, Cartesian_t* pDstPos, PixelFormat_e SrcPixelFormat_e, BlendMode_e BlendMode)
{
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_GotoXY
//
//  Parameter(s):   uint8_t         PosX
//                  uint8_t         PosY
//  Return:         None
//
//  Description:    Goto a specific X,Y position
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_GotoXY(uint8_t PosX, uint8_t PosY)
{
    int Offset;
    
    DRV_WriteCommand(SED1330_SET_CURSOR_ADDRESS);
    Offset = (SED1330_LINE_LENGTH * PosY) + PosX;
    DRV_u8_Write((uint8_t)Offset);                        // P1
    DRV_u8_Write((uint8_t)(Offset >> 8));                // P2
}



//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_CopyLinear
//
//  Parameter(s):   void*           pSrc
//                  Box_t*          pBox
//                  PixelFormat_e   SrcPixelFormat_e)
//                  BlendMode_e     BlendMode
//  Return:         None
//
//   Description:   Copy a rectangle region from linear memory region to square memory area
//
//  Note(s):        Source is linear
//
//-------------------------------------------------------------------------------------------------
void DRV_CopyLinear(void* pSrc, Box_t* pBox, PixelFormat_e SrcPixelFormat_e, BlendMode_e BlendMode)
{
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DrawCircle
//
//  Parameter(s):   Circle_t*   pBox
//  Return:         None
//
//  Description:
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DrawCircle(uint8_t X, uint8_t Y, uint8_t Radius, uint8_t Mode)
{
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DrawRectangle
//
//  Parameter(s):   Box_t*   pBox
//  Return:         None
//
//  Description:    Fill a region in a specific color
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DrawRectangle(Box_t* pBox)
{
    DRV__DrawRectangle(pBox, FILL);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DrawBox
//
//  Parameter(s):   uint16_t    PosX
//                  uint16_t    PosY
//                  uint16_t    Length
//                  uint16_t    Height
//                  uint16_t    Thickness
//  Return:         None
//
//  Description:    Draw a box in a specific thickness
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DrawBox(uint16_t PosX, uint16_t PosY, uint16_t Length, uint16_t Height, uint16_t Thickness)
{
    Box_t Box;
    int   i;

    Box. = PosX;
    Box. = PosY;
    Box. = Length;
    Box. = Height;

    while(1)
    {
        DRV__DrawRectangle(pBox, NO_FILL);

        Thickness--;
        if(Thickness == 0)
        {
            return;
        }

        Box. ++;
        Box. ++;
        Box. -= 2;
        Box. -= 2;
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DrawPixel
//
//  Parameter(s):   uint16_t    PosX
//                  uint16_t    PosY
//  Return:         None
//
//  Description:    Put a pixel on LCD
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DrawPixel(uint16_t PosX, uint16_t PosY)
{
//void SED1330_Pixel(BYTE byPosX, BYTE byPosY, BYTE byMode)
    int nOffset;
    uint8_t Byte;
        
    nOffset = (SED1330_LINE_LENGTH * PosY) + (PosX >> 3);
    PosX = 7 - (PosX & 0x07);

    DRV_GotoMemory(nOffset + SED1330_GRAPHIC_MEMORY);
    DRV_WriteCommand(SED1330_MEMORY_READ);
    Byte = SED1330_ReadByte();

    switch(Mode)
    {
        case ON:    { SetBitByte(Byte, PosX); break; }
        case OFF:   { ClrBitByte(Byte, PosX); break; }
        case TOGGLE:{ ToggleBitByte(Byte, PosX); break; }
    }

    DRV_GotoMemory(nOffset + SED1330_GRAPHIC_MEMORY);
    DRV_WriteCommand(SED1330_MEMORY_WRITE);
    DRV_u8_Write(Byte);

