aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_256x128-SED1330.cpp
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DrawHLine
//
//  Parameter(s):   uint16_t    Y
//                  uint16_t    X1
//                  uint16_t    X2
//                  uint16_t    ThickNess
//  Return:         None
//
//  Description:    Displays a horizontal line of a specific thickness.
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DrawHLine(uint16_t PosY, uint16_t PosX1, uint16_t PosX2, uint16_t Thickness)
{
    uint16_t Length;

    // X1 need to be the lowest (STM32 need this)
    if(PosX1 > PosX2)
    {
        Length = PosX1 - PosX2;
        PosX1  = PosX2;
    }
    else
    {
        Length = PosX2 - PosX1;
    }

    DRV_DrawLine(PosX1, PosY, Length, Thickness, DRAW_HORIZONTAL);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DrawVLine
//
//  Parameter(s):   uint16_t    wPosX
//                  uint16_t    wPosY1
//                  uint16_t    wPosY2
//                  uint16_t    wThickNess
//  Return:         None
//
//  Description:    Displays a vertical line of a specific thickness.
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DrawVLine(uint16_t PosX, uint16_t PosY1, uint16_t PosY2, uint16_t Thickness)
{
    uint16_t Length;

    // Y1 need to be the lowest (STM32 need this)
    if(PosY1 > PosY2)
    {
        Length = PosY1 - PosY2;
        PosY1  = PosY2;
    }
    else
    {
        Length = PosY2 - PosY1;
    }

    DRV_DrawLine(PosX, PosY1, Length, Thickness, DRAW_VERTICAL);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DrawLine
//
//  Parameter(s):   uint16_t   PosX       Specifies the X position, can be a value from 0 to 240.
//                  uint16_t   PosY       Specifies the Y position, can be a value from 0 to 320.
//                  uint16_t   Length     Line length.
//                  uint16_t   ThickNess
//                  DrawMode_e Direction  line direction.
//                                        This Parameter can be one of the following values
//                                                 DRAW_HORIZONTAL
//                                                 DRAW_VERTICAL
//  Return:         None
//
//  Description:    Displays a line of a specific thickness.
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DrawLine(uint16_t PosX, uint16_t PosY, uint16_t Length, uint16_t ThickNess, DrawMode_e Direction)
{
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_PrintFont
//
//  Parameter(s):   FONT_sDescriptor*   pDescriptor
//                  Cartesian_t*        pPos
//  Return:         none
//
//  Description:    This function will print a font to drawing layer with the drawing color
//
//-------------------------------------------------------------------------------------------------
void DRV_PrintFont(FontDescriptor_t* pDescriptor, Cartesian_t* pPos)
{
    //pLayer             = &LayerTable[CLayer::GetDrawing()];
    //PixFmt             = pLayer->GetPixelFormat();
    //PixelFormat        = DRV_PixelFormatTable[PixFmt];
    //PixelSize          = pLayer->GetPixelSize();
    //Address            = pLayer->GetAddress() + (((pPos->Y * GRAFX_SIZE_X) + pPos->X) * (uint32_t)PixelSize);
    //AreaConfig.u_16.u1 = pDescriptor->Size.Width;
    //AreaConfig.u_16.u0 = pDescriptor->Size.Height;

//    DMA2D->FGMAR       = (uint32_t)pDescriptor->pAddress;                           // Source address 1
//    DMA2D->FGCOLR      = pLayer->GetTextColor();
//    DMA2D->BGOR        = (uint32_t)GRAFX_SIZE_X - (uint32_t)AreaConfig.u_16.u1;     // Font source line offset - none as we are linear
    //DMA2D->BGPFCCR     = PixelFormat;                                               // Defines the number of pixels to be transfered

    // Output Layer
//    DMA2D->OMAR        = Address;
    //DMA2D->OOR         = (uint32_t)GRAFX_SIZE_X - (uint32_t)AreaConfig.u_16.u1;     // Destination line offset
    //DMA2D->OPFCCR      = PixelFormat;

    // Area
    //DMA2D->NLR         = AreaConfig.u_32;                                           // Size configuration of area to be transfered
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DisplayOn
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Enables the Display
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DisplayOn(void)
{
    DRV_WriteCommand(DRV_LCD_DISPLAY_ON);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DisplayOff
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Disables the Display
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DisplayOff(void)
{
    DRV_WriteCommand(DRV_LCD_DISPLAY_OFF);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_Clear
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Clear and home the LCD
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_Clear(void)
{
    int i;

    // Clear Text Area
    DRV_GotoMemory(SED1330_TEXT_MEMORY);
    DRV_WriteCommand(SED1330_MEMORY_WRITE);
    for(i = 0; i < SED1330_TEXT_SIZE; i++)
    {
        DRV_u8_Write(ASCII_SPACE);                
    }

    // Clear Graphic Area
    DRV_GotoMemory(SED1330_GRAPHIC_MEMORY);
    DRV_WriteCommand(SED1330_MEMORY_WRITE);
    for(i = 0; i < SED1330_GRAPHIC_SIZE; i++)
    {
        DRV_u8_Write(0x00);                
    }
}



