aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_256x128-SED1330.cpp
//-----------------------------------------------------------------------------
//
// Transfert bitmap for a custom character
//
//-----------------------------------------------------------------------------
void DRV_SetCustomFont(uint8_t Number, const char* pString)
{
    uint8_t Count = 8;
        
    DRV_WriteCommand(SED1330_SET_CURSOR_ADDRESS);
    Number &= 0x3F;                                // no value over 63
    DRV_u8_Write(Number << 8);                    // P1    ??????????  envoie 0 alors le clown!!
    DRV_u8_Write(Number >> 5);                    // P2
    
    DRV_WriteCommand(SED1330_MEMORY_WRITE);
    do
    {
        Count--;    
        DRV_u8_Write(pString[Count]);
    }
    while(Count != 0);
}


//-----------------------------------------------------------------------------
//
// write a string of chars to the LCD
//
//-----------------------------------------------------------------------------
void DRV_Puts(const char* pString)
{
    uint8_t i;
    
    i = 0;
    DRV_WriteCommand(SED1330_MEMORY_WRITE);
    
    while(sString[i] != ASCII_NULL)
    {
        DRV_u8_Write(pString[i++]);
    }
}

//-----------------------------------------------------------------------------
//
// write one character to the LCD
//
//-----------------------------------------------------------------------------
void DRV_Putc(char Character)
{
    DRV_WriteCommand(SED1330_MEMORY_WRITE);
    DRV_u8_Write(Character);
}


//-------------------------------------------------------------------------------------------------

#endif // DIGINI_USE_GRAFX

